
     /**
     * Реализовать класс-счетчик.
     * Полями класса должны выступать:
     * (+)  1) Название счетчика
     * (+)  2) Целочисленный счетчик
     * <p>
     * (+)  Реализовать для созданного класса конструктор:
     * (+)  1) С двумя параметрами
     * (+)  2) С одним (значение счетчика в таком случае инициализировать как 0)
     * <p>
     * Методы:
     * (+)  1) Увеличения и уменьшения счетчиков на 1
     * (+)  2) Увеличения и уменьшения счетчиков на заданное пользователем целое значение
     * (+)  Методы должны возвращать актуальное значение счетчика.
     * <p>
     * (+)  Используя созданный класс, посчитать количество четных и количество нечетных чисел в ряду от 1 до 100.
     * (+)  Конечные показатели счетчиков вывести в консоль.
     * <p>
     * (+)  Пример вывода в консоли:
     * (+)  Нечетные числа: 50
     * (+)  Четные числа: 50
     * <p>
     * (+)  Два конструктора. Класс четчика 1, а вот объектов мб и много.
     */

public class Buffer {
  public static void main(String[] args) {
  }
}














