public class Lesson_10_2 {

  /**
   * Вычислить из записать в массив первые 10 простых чисел.
   * <p>
   * Простое число – положительное целое число,
   * которое делится без остатка лишь на себя и на 1.
   * 1 не является простым числом.
   * <p>
   * Вывести в консоль сумму всех элементов полученного массива.
   * <p>
   * Нахождение простых чисел и вычисление суммы реализовать, используя рекурсивные методы.
   */

  public static void main(String[] args) {

    int[] primeNumbers = new int[10];

  }

}
